Autodesk.Revit.DB.ViewDrafting.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new ViewDrafting in the model.
document:
The document in which the new drafting view will be created.
viewFamilyTypeId:
The id of the ViewFamilyType that should be assigned to the new drafting view.
Returns:
The newly created drafting view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewFamilyTypeId is not a valid ViewFamilyType for a drafting view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015